/**
 * Created by boss on 25 августа.
 */
/*
Какими будут результаты у выражений?
1. new Date(0) - 0
2. new Array(1)[0] + “"
3. ({})[0]
4. [1] + 1
5. [1,2] + [3,4]
6. [] + null + 1
7. [[0]][0][0]
8. ({} + {})


Ответы:

1. 0 (объект с датой преобразуется в 0, т.к. 0 = 0 ms);
2. undefined (создается массив с 1 пустышкой, которая возвращает undefined. undefined +'' = undefined);
3. undefined ( пустой объект = не имеет свойств, т.е. 0 свойство вернет undefined);
4. 11 ([1] вернет строку '1', '1' +1 = '11');
5. '1,23,4';
6. "null1" ([] вернет ''. '' + null +1 = 'null1');
7. 0 ([[0]] = 0);
8. "[object Object][object Object]";

*/